[
  {"id":"clearyComparingVariantCall2015","abstract":"ABSTRACT\n          \n            Summary\n            \n              To evaluate and compare the performance of variant calling methods and their confidence scores, comparisons between a\n              test call\n              set and a\n              “gold standard”\n              need to be carried out. Unfortunately, these comparisons are not straightforward with the current Variant Call Files (VCF), which are the standard output of most variant calling algorithms for high-throughput sequencing data. Comparisons of VCFs are often confounded by the different representations of indels, MNPs, and combinations thereof with SNVs in complex regions of the genome, resulting in misleading results. A variant caller is inherently a classification method designed to score putative variants with confidence scores that could permit controlling the rate of false positives (FP) or false negatives (FN) for a given application. Receiver operator curves (ROC) and the area under the ROC (AUC) are efficient metrics to evaluate a test call set versus a gold standard. However, in the case of VCF data this also requires a special accounting to deal with discrepant representations. We developed a novel algorithm for comparing variant call sets that deals with complex call representation discrepancies and through a dynamic programing method that minimizes false positives and negatives globally across the entire call sets for accurate performance evaluation of VCFs.\n            \n          \n          \n            Availability\n            \n              RTG Tools is implemented as a multithreaded Java application and source code is available under BSD license at:\n              https://github.com/RealTimeGenomics/rtg-tools\n            \n          \n          \n            Contact\n            \n              len@realtimegenomics.com\n            \n          \n          \n            Supplementary information\n            \n              Supplementary data are available at\n              Bioinformatics online\n              .","accessed":{"date-parts":[["2025",2,11]]},"author":[{"family":"Cleary","given":"John G."},{"family":"Braithwaite","given":"Ross"},{"family":"Gaastra","given":"Kurt"},{"family":"Hilbush","given":"Brian S."},{"family":"Inglis","given":"Stuart"},{"family":"Irvine","given":"Sean A."},{"family":"Jackson","given":"Alan"},{"family":"Littin","given":"Richard"},{"family":"Rathod","given":"Mehul"},{"family":"Ware","given":"David"},{"family":"Zook","given":"Justin M."},{"family":"Trigg","given":"Len"},{"family":"De La Vega","given":"Francisco M."}],"citation-key":"clearyComparingVariantCall2015","DOI":"10.1101/023754","issued":{"date-parts":[["2015",8,2]]},"language":"en","license":"© 2015, Posted by Cold Spring Harbor Laboratory. This pre-print is available under a Creative Commons License (Attribution-NoDerivs 4.0 International), CC BY-ND 4.0, as described at http://creativecommons.org/licenses/by-nd/4.0/","publisher":"bioRxiv","source":"bioRxiv","title":"Comparing variant call files for performance benchmarking of next-generation sequencing variant calling pipelines","type":"article","URL":"https://www.biorxiv.org/content/10.1101/023754v2"},
  {"id":"danecekTwelveYearsSAMtools2021","abstract":"Abstract\n            \n              Background\n              SAMtools and BCFtools are widely used programs for processing and analysing high-throughput sequencing data. They include tools for file format conversion and manipulation, sorting, querying, statistics, variant calling, and effect analysis amongst other methods.\n            \n            \n              Findings\n              The first version appeared online 12 years ago and has been maintained and further developed ever since, with many new features and improvements added over the years. The SAMtools and BCFtools packages represent a unique collection of tools that have been used in numerous other software projects and countless genomic pipelines.\n            \n            \n              Conclusion\n              Both SAMtools and BCFtools are freely available on GitHub under the permissive MIT licence, free for both non-commercial and commercial use. Both packages have been installed &gt;1 million times via Bioconda. The source code and documentation are available from https://www.htslib.org.","author":[{"family":"Danecek","given":"Petr"},{"family":"Bonfield","given":"James K"},{"family":"Liddle","given":"Jennifer"},{"family":"Marshall","given":"John"},{"family":"Ohan","given":"Valeriu"},{"family":"Pollard","given":"Martin O"},{"family":"Whitwham","given":"Andrew"},{"family":"Keane","given":"Thomas"},{"family":"McCarthy","given":"Shane A"},{"family":"Davies","given":"Robert M"},{"family":"Li","given":"Heng"}],"citation-key":"danecekTwelveYearsSAMtools2021","container-title":"GigaScience","container-title-short":"GigaScience","DOI":"10.1093/gigascience/giab008","ISSN":"2047-217X","issue":"2","issued":{"date-parts":[["2021",1,29]]},"language":"en","page":"giab008","source":"PubMed","title":"Twelve years of SAMtools and BCFtools","type":"article-journal","URL":"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giab008/6137722","volume":"10"},
  {"id":"danecekVariantCallFormat2011","abstract":"Abstract\n            Summary: The variant call format (VCF) is a generic format for storing DNA polymorphism data such as SNPs, insertions, deletions and structural variants, together with rich annotations. VCF is usually stored in a compressed manner and can be indexed for fast data retrieval of variants from a range of positions on the reference genome. The format was developed for the 1000 Genomes Project, and has also been adopted by other projects such as UK10K, dbSNP and the NHLBI Exome Project. VCFtools is a software suite that implements various utilities for processing VCF files, including validation, merging, comparing and also provides a general Perl API.\n            Availability:  http://vcftools.sourceforge.net\n            Contact:  rd@sanger.ac.uk","author":[{"family":"Danecek","given":"Petr"},{"family":"Auton","given":"Adam"},{"family":"Abecasis","given":"Goncalo"},{"family":"Albers","given":"Cornelis A."},{"family":"Banks","given":"Eric"},{"family":"DePristo","given":"Mark A."},{"family":"Handsaker","given":"Robert E."},{"family":"Lunter","given":"Gerton"},{"family":"Marth","given":"Gabor T."},{"family":"Sherry","given":"Stephen T."},{"family":"McVean","given":"Gilean"},{"family":"Durbin","given":"Richard"},{"literal":"1000 Genomes Project Analysis Group"}],"citation-key":"danecekVariantCallFormat2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr330","ISSN":"1367-4811, 1367-4803","issue":"15","issued":{"date-parts":[["2011",8,1]]},"language":"en","page":"2156-2158","source":"DOI.org (Crossref)","title":"The variant call format and VCFtools","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/27/15/2156/402296","volume":"27"},
  {"id":"ewelsMultiQCSummarizeAnalysis2016","abstract":"Motivation: Fast and accurate quality control is essential for studies involving next-generation sequencing data. Whilst numerous tools exist to quantify QC metrics, there is no common approach to flexibly integrate these across tools and large sample sets. Assessing analysis results across an entire project can be time consuming and error prone; batch effects and outlier samples can easily be missed in the early stages of analysis., Results: We present MultiQC, a tool to create a single report visualising output from multiple tools across many samples, enabling global trends and biases to be quickly identified. MultiQC can plot data from many common bioinformatics tools and is built to allow easy extension and customization., Availability and implementation: MultiQC is available with an GNU GPLv3 license on GitHub, the Python Package Index and Bioconda. Documentation and example reports are available at \nhttp://multiqc.info, Contact:\nphil.ewels@scilifelab.se","accessed":{"date-parts":[["2017",7,19]]},"author":[{"family":"Ewels","given":"Philip"},{"family":"Magnusson","given":"Måns"},{"family":"Lundin","given":"Sverker"},{"family":"Käller","given":"Max"}],"citation-key":"ewelsMultiQCSummarizeAnalysis2016","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btw354","ISSN":"1367-4803","issue":"19","issued":{"date-parts":[["2016",10,1]]},"language":"en","note":"00021","page":"3047-3048","source":"PubMed Central","title":"MultiQC: summarize analysis results for multiple tools and samples in a single report","title-short":"MultiQC","type":"article-journal","URL":"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC5039924/","volume":"32"},
  {"id":"garrisonHaplotypebasedVariantDetection2012","abstract":"The direct detection of haplotypes from short-read DNA sequencing data requires changes to existing small-variant detection methods. Here, we develop a Bayesian statistical framework which is capable of modeling multiallelic loci in sets of individuals with non-uniform copy number. We then describe our implementation of this framework in a haplotype-based variant detector, FreeBayes.","accessed":{"date-parts":[["2023",6,27]]},"author":[{"family":"Garrison","given":"Erik"},{"family":"Marth","given":"Gabor"}],"citation-key":"garrisonHaplotypebasedVariantDetection2012","DOI":"10.48550/ARXIV.1207.3907","issued":{"date-parts":[["2012"]]},"language":"en","license":"Creative Commons Attribution 3.0 Unported","source":"DOI.org (Datacite)","title":"Haplotype-based variant detection from short-read sequencing","type":"article-journal","URL":"https://arxiv.org/abs/1207.3907"},
  {"id":"heldenbrandRecommendationsPerformanceOptimizations2019","abstract":"Use of the Genome Analysis Toolkit (GATK) continues to be the standard practice in genomic variant calling in both research and the clinic. Recently the toolkit has been rapidly evolving. Significant computational performance improvements have been introduced in GATK3.8 through collaboration with Intel in 2017. The first release of GATK4 in early 2018 revealed rewrites in the code base, as the stepping stone toward a Spark implementation. As the software continues to be a moving target for optimal deployment in highly productive environments, we present a detailed analysis of these improvements, to help the community stay abreast with changes in performance.","accessed":{"date-parts":[["2021",4,3]]},"author":[{"family":"Heldenbrand","given":"Jacob R."},{"family":"Baheti","given":"Saurabh"},{"family":"Bockol","given":"Matthew A."},{"family":"Drucker","given":"Travis M."},{"family":"Hart","given":"Steven N."},{"family":"Hudson","given":"Matthew E."},{"family":"Iyer","given":"Ravishankar K."},{"family":"Kalmbach","given":"Michael T."},{"family":"Kendig","given":"Katherine I."},{"family":"Klee","given":"Eric W."},{"family":"Mattson","given":"Nathan R."},{"family":"Wieben","given":"Eric D."},{"family":"Wiepert","given":"Mathieu"},{"family":"Wildman","given":"Derek E."},{"family":"Mainzer","given":"Liudmila S."}],"citation-key":"heldenbrandRecommendationsPerformanceOptimizations2019","container-title":"BMC Bioinformatics","container-title-short":"BMC Bioinf.","DOI":"10.1186/s12859-019-3169-7","ISSN":"1471-2105","issue":"1","issued":{"date-parts":[["2019",11,8]]},"language":"en","page":"557","source":"BioMed Central","title":"Recommendations for performance optimizations when using GATK3.8 and GATK4","type":"article-journal","URL":"https://doi.org/10.1186/s12859-019-3169-7","volume":"20"},
  {"id":"liComparingGenomicVariant2023","abstract":"Genomic analyses are widely applied to epidemiological, population genetic and experimental studies of pathogenic fungi. A wide range of methods are employed to carry out these analyses, typically without including controls that gauge the accuracy of variant prediction. The importance of tracking outbreaks at a global scale has raised the urgency of establishing high-accuracy pipelines that generate consistent results between research groups. To evaluate currently employed methods for whole-genome variant detection and elaborate best practices for fungal pathogens, we compared how 14 independent variant calling pipelines performed across 35\n              Candida auris\n              isolates from 4 distinct clades and evaluated the performance of variant calling, single-nucleotide polymorphism (SNP) counts and phylogenetic inference results. Although these pipelines used different variant callers and filtering criteria, we found high overall agreement of SNPs from each pipeline. This concordance correlated with site quality, as SNPs discovered by a few pipelines tended to show lower mapping quality scores and depth of coverage than those recovered by all pipelines. We observed that the major differences between pipelines were due to variation in read trimming strategies, SNP calling methods and parameters, and downstream filtration criteria. We calculated specificity and sensitivity for each pipeline by aligning three isolates with chromosomal level assemblies and found that the GATK-based pipelines were well balanced between these metrics. Selection of trimming methods had a greater impact on SAMtools-based pipelines than those using GATK. Phylogenetic trees inferred by each pipeline showed high consistency at the clade level, but there was more variability between isolates from a single outbreak, with pipelines that used more stringent cutoffs having lower resolution. This project generated two truth datasets useful for routine benchmarking of\n              C. auris\n              variant calling, a consensus VCF of genotypes discovered by 10 or more pipelines across these 35 diverse isolates and variants for 2 samples identified from whole-genome alignments. This study provides a foundation for evaluating SNP calling pipelines and developing best practices for future fungal genomic studies.","accessed":{"date-parts":[["2023",5,24]]},"author":[{"family":"Li","given":"Xiao"},{"family":"Muñoz","given":"José F."},{"family":"Gade","given":"Lalitha"},{"family":"Argimon","given":"Silvia"},{"family":"Bougnoux","given":"Marie-Elisabeth"},{"family":"Bowers","given":"Jolene R."},{"family":"Chow","given":"Nancy A."},{"family":"Cuesta","given":"Isabel"},{"family":"Farrer","given":"Rhys A."},{"family":"Maufrais","given":"Corinne"},{"family":"Monroy-Nieto","given":"Juan"},{"family":"Pradhan","given":"Dibyabhaba"},{"family":"Uehling","given":"Jessie"},{"family":"Vu","given":"Duong"},{"family":"Yeats","given":"Corin A."},{"family":"Aanensen","given":"David M."},{"family":"Enfert","given":"Christophe"},{"family":"Engelthaler","given":"David M."},{"family":"Eyre","given":"David W."},{"family":"Fisher","given":"Matthew C."},{"family":"Hagen","given":"Ferry"},{"family":"Meyer","given":"Wieland"},{"family":"Singh","given":"Gagandeep"},{"family":"Alastruey-Izquierdo","given":"Ana"},{"family":"Litvintseva","given":"Anastasia P."},{"family":"Cuomo","given":"Christina A."}],"citation-key":"liComparingGenomicVariant2023","container-title":"Microbial Genomics","container-title-short":"Microb. Genomics","DOI":"10.1099/mgen.0.000979","ISSN":"2057-5858","issue":"4","issued":{"date-parts":[["2023",4,12]]},"language":"en","page":"979","source":"Microbiology Society Journals","title":"Comparing genomic variant identification protocols for <span class=\"nocase\"><i>Candida auris</i></span>","type":"article-journal","URL":"https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.000979","volume":"9"},
  {"id":"liStatisticalFrameworkSNP2011","abstract":"Abstract\n            Motivation: Most existing methods for DNA sequence analysis rely on accurate sequences or genotypes. However, in applications of the next-generation sequencing (NGS), accurate genotypes may not be easily obtained (e.g. multi-sample low-coverage sequencing or somatic mutation discovery). These applications press for the development of new methods for analyzing sequence data with uncertainty.\n            Results: We present a statistical framework for calling SNPs, discovering somatic mutations, inferring population genetical parameters and performing association tests directly based on sequencing data without explicit genotyping or linkage-based imputation. On real data, we demonstrate that our method achieves comparable accuracy to alternative methods for estimating site allele count, for inferring allele frequency spectrum and for association mapping. We also highlight the necessity of using symmetric datasets for finding somatic mutations and confirm that for discovering rare events, mismapping is frequently the leading source of errors.\n            Availability:  http://samtools.sourceforge.net\n            Contact:  hengli@broadinstitute.org","accessed":{"date-parts":[["2023",6,27]]},"author":[{"family":"Li","given":"Heng"}],"citation-key":"liStatisticalFrameworkSNP2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr509","ISSN":"1367-4811, 1367-4803","issue":"21","issued":{"date-parts":[["2011",11,1]]},"language":"en","page":"2987-2993","source":"PubMed Central","title":"A statistical framework for SNP calling, mutation discovery, association mapping and population genetical parameter estimation from sequencing data","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3198575/","volume":"27"},
  {"id":"okonechnikovQualimapAdvancedMultisample2016","abstract":"Motivation: Detection of random errors and systematic biases is a crucial step of a robust pipeline for processing high-throughput sequencing (HTS) data. Bioinformatics software tools capable of performing this task are available, either for general analysis of HTS data or targeted to a specific sequencing technology. However, most of the existing QC instruments only allow processing of one sample at a time.Results: Qualimap 2 represents a next step in the QC analysis of HTS data. Along with comprehensive single-sample analysis of alignment data, it includes new modes that allow simultaneous processing and comparison of multiple samples. As with the first version, the new features are available via both graphical and command line interface. Additionally, it includes a large number of improvements proposed by the user community.Availability and implementation: The implementation of the software along with documentation is freely available at http://www.qualimap.org.Contact:meyer@mpiib-berlin.mpg.deSupplementary information:Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2017",7,28]]},"author":[{"family":"Okonechnikov","given":"Konstantin"},{"family":"Conesa","given":"Ana"},{"family":"García-Alcalde","given":"Fernando"}],"citation-key":"okonechnikovQualimapAdvancedMultisample2016","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btv566","ISSN":"1367-4803","issue":"2","issued":{"date-parts":[["2016",1,15]]},"language":"en","note":"00050","page":"292-294","source":"academic.oup.com","title":"Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data","title-short":"Qualimap 2","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/32/2/292/1744356/Qualimap-2-advanced-multi-sample-quality-control","volume":"32"},
  {"id":"pedersenMosdepthQuickCoverage2018","abstract":"Abstract\n            \n              Summary\n              Mosdepth is a new command-line tool for rapidly calculating genome-wide sequencing coverage. It measures depth from BAM or CRAM files at either each nucleotide position in a genome or for sets of genomic regions. Genomic regions may be specified as either a BED file to evaluate coverage across capture regions, or as a fixed-size window as required for copy-number calling. Mosdepth uses a simple algorithm that is computationally efficient and enables it to quickly produce coverage summaries. We demonstrate that mosdepth is faster than existing tools and provides flexibility in the types of coverage profiles produced.\n            \n            \n              Availability and implementation\n              mosdepth is available from https://github.com/brentp/mosdepth under the MIT license.\n            \n            \n              Supplementary information\n              Supplementary data are available at Bioinformatics online.","author":[{"family":"Pedersen","given":"Brent S"},{"family":"Quinlan","given":"Aaron R"}],"citation-key":"pedersenMosdepthQuickCoverage2018","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btx699","editor":[{"family":"Hancock","given":"John"}],"ISSN":"1367-4803, 1367-4811","issue":"5","issued":{"date-parts":[["2018",3,1]]},"language":"en","page":"867-868","source":"PubMed","title":"Mosdepth: quick coverage calculation for genomes and exomes","title-short":"Mosdepth","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/34/5/867/4583630","volume":"34"},
  {"id":"rudenUsingDrosophilaMelanogaster2012","abstract":"This paper describes a new program SnpSift for filtering differential DNA sequence variants between two or more experimental genomes after genotoxic chemical exposure. Here, we illustrate how SnpSift can be used to identify candidate phenotype-relevant variants including single nucleotide polymorphisms, multiple nucleotide polymorphisms, insertions, and deletions (InDels) in mutant strains isolated from genome-wide chemical mutagenesis of Drosophila melanogaster. First, the genomes of two independently isolated mutant fly strains that are allelic for a novel recessive male-sterile locus generated by genotoxic chemical exposure were sequenced using the Illumina next-generation DNA sequencer to obtain 20- to 29-fold coverage of the euchromatic sequences. The sequencing reads were processed and variants were called using standard bioinformatic tools. Next, SnpEff was used to annotate all sequence variants and their potential mutational effects on associated genes. Then, SnpSift was used to filter and select differential variants that potentially disrupt a common gene in the two allelic mutant strains. The potential causative DNA lesions were partially validated by capillary sequencing of polymerase chain reaction-amplified DNA in the genetic interval as defined by meiotic mapping and deletions that remove defined regions of the chromosome. Of the five candidate genes located in the genetic interval, the Pka-like gene CG12069 was found to carry a separate pre-mature stop codon mutation in each of the two allelic mutants whereas the other four candidate genes within the interval have wild-type sequences. The Pka-like gene is therefore a strong candidate gene for the male-sterile locus. These results demonstrate that combining SnpEff and SnpSift can expedite the identification of candidate phenotype-causative mutations in chemically mutagenized Drosophila strains. This technique can also be used to characterize the variety of mutations generated by genotoxic chemicals.","accessed":{"date-parts":[["2016",11,4]]},"author":[{"family":"Ruden","given":"Douglas Mark"},{"family":"Cingolani","given":"Pablo"},{"family":"Patel","given":"Viral M."},{"family":"Coon","given":"Melissa"},{"family":"Nguyen","given":"Tung"},{"family":"Land","given":"Susan J."},{"family":"Lu","given":"Xiangyi"}],"citation-key":"rudenUsingDrosophilaMelanogaster2012","container-title":"Toxicogenomics","container-title-short":"Toxicogenomics","DOI":"10.3389/fgene.2012.00035","issued":{"date-parts":[["2012"]]},"language":"en","page":"35","source":"Frontiers","title":"Using <i>drosophila melanogaster</i> as a model for genotoxic chemical mutational studies with a new program, SnpSift","type":"article-journal","URL":"http://journal.frontiersin.org/article/10.3389/fgene.2012.00035/full","volume":"3"},
  {"id":"tischlerBiobambamToolsRead2014","abstract":"Sequence alignment data is often ordered by coordinate (id of the reference sequence plus position on the sequence where the fragment was mapped) when stored in BAM files, as this simplifies the extraction of variants between the mapped data and the reference or of variants within the mapped data. In this order paired reads are usually separated in the file, which complicates some other applications like duplicate marking or conversion to the FastQ format which require to access the full information of the pairs.","accessed":{"date-parts":[["2020",11,25]]},"author":[{"family":"Tischler","given":"German"},{"family":"Leonard","given":"Steven"}],"citation-key":"tischlerBiobambamToolsRead2014","container-title":"Source Code for Biology and Medicine","container-title-short":"Source Code Biol. Med.","DOI":"10.1186/1751-0473-9-13","ISSN":"1751-0473","issue":"1","issued":{"date-parts":[["2014",6,20]]},"language":"en","page":"13","source":"BioMed Central","title":"biobambam: tools for read pair collation based algorithms on BAM files","title-short":"biobambam","type":"article-journal","URL":"https://doi.org/10.1186/1751-0473-9-13","volume":"9"},
  {"id":"vanderauweraFastQDataHighConfidence2002","abstract":"This unit describes how to use BWA and the Genome Analysis Toolkit (GATK) to map genome sequencing data to a reference and produce high-quality variant calls that can be used in downstream analyses. The complete workflow includes the core NGS data-processing steps that are necessary to make the raw data suitable for analysis by the GATK, as well as the key methods involved in variant discovery using the GATK. Curr. Protoc. Bioinform. 43:11.10.1-11.10.33. © 2013 by John Wiley & Sons, Inc.","accessed":{"date-parts":[["2015",4,3]]},"author":[{"family":"Van der Auwera","given":"Geraldine A."},{"family":"Carneiro","given":"Mauricio O."},{"family":"Hartl","given":"Christopher"},{"family":"Poplin","given":"Ryan"},{"family":"Angel","given":"Guillermo"},{"family":"Levy-Moonshine","given":"Ami"},{"family":"Jordan","given":"Tadeusz"},{"family":"Shakir","given":"Khalid"},{"family":"Roazen","given":"David"},{"family":"Thibault","given":"Joel"},{"family":"Banks","given":"Eric"},{"family":"Garimella","given":"Kiran V."},{"family":"Altshuler","given":"David"},{"family":"Gabriel","given":"Stacey"},{"family":"DePristo","given":"Mark A."}],"citation-key":"vanderauweraFastQDataHighConfidence2002","container-title":"Current Protocols in Bioinformatics","ISBN":"978-0-471-25095-1","issued":{"date-parts":[["2002"]]},"language":"en","license":"Copyright © 2013 John Wiley & Sons, Inc. All rights reserved.","publisher":"John Wiley & Sons, Inc.","source":"Wiley Online Library","title":"From FastQ data to high-confidence variant calls: the genome analysis toolkit best practices pipeline","title-short":"From FastQ data to high-confidence variant calls","type":"chapter","URL":"http://onlinelibrary.wiley.com/doi/10.1002/0471250953.bi1110s43/abstract"},
  {"id":"vasimuddinEfficientArchitectureAwareAcceleration2019","abstract":"Innovations in Next-Generation Sequencing are enabling generation of DNA sequence data at ever faster rates and at very low cost. For example, the Illumina NovaSeq 6000 sequencer can generate 6 Terabases of data in less than two days, sequencing nearly 20 Billion short DNA fragments called reads at the low cost of $1000 per human genome. Large sequencing centers typically employ hundreds of such systems. Such highthroughput and low-cost generation of data underscores the need for commensurate acceleration in downstream computational analysis of the sequencing data. A fundamental step in downstream analysis is mapping of the reads to a long reference DNA sequence, such as a reference human genome. Sequence mapping is a compute-intensive step that accounts for more than 30% of the overall time of the GATK (Genome Analysis ToolKit) best practices workflow. BWA-MEM is one of the most widely used tools for sequence mapping and has tens of thousands of users. In this work, we focus on accelerating BWA-MEM through an efficient architecture aware implementation, while maintaining identical output. The volume of data requires distributed computing and is usually processed on clusters or cloud deployments with multicore processors usually being the platform of choice. Since the application can be easily parallelized across multiple sockets (even across distributed memory systems) by simply distributing the reads equally, we focus on performance improvements on a single socket multicore processor. BWA-MEM run time is dominated by three kernels, collectively responsible for more than 85% of the overall compute time. We improved the performance of the three kernels by 1) using techniques to improve cache reuse, 2) simplifying the algorithms, 3) replacing many small memory allocations with a few large contiguous ones to improve hardware prefetching of data, 4) software prefetching of data, and 5) utilization of SIMD wherever applicable and massive reorganization of the source code to enable these improvements. As a result, we achieved nearly 2x, 183x, and 8x speedups on the three kernels, respectively, resulting in up to 3.5x and 2.4x speedups on end-to-end compute time over the original BWA-MEM on single thread and single socket of Intel Xeon Skylake processor. To the best of our knowledge, this is the highest reported speedup over BWA-MEM (running on a single CPU) while using a single CPU or a single CPU-single GPGPU/FPGA combination.","author":[{"family":"Vasimuddin","given":"Md."},{"family":"Misra","given":"Sanchit"},{"family":"Li","given":"Heng"},{"family":"Aluru","given":"Srinivas"}],"citation-key":"vasimuddinEfficientArchitectureAwareAcceleration2019","container-title":"2019 IEEE International Parallel and Distributed Processing Symposium (IPDPS)","DOI":"10.1109/IPDPS.2019.00041","event-title":"2019 IEEE International Parallel and Distributed Processing Symposium (IPDPS)","issued":{"date-parts":[["2019",5]]},"language":"en","page":"314-324","source":"IEEE Xplore","title":"Efficient architecture-aware acceleration of BWA-MEM for multicore systems","type":"paper-conference"},
  {"id":"yueSunUpSunsetGenomes2022","accessed":{"date-parts":[["2025",4,7]]},"author":[{"family":"Yue","given":"Jingjing"},{"family":"VanBuren","given":"Robert"},{"family":"Liu","given":"Juan"},{"family":"Fang","given":"Jingping"},{"family":"Zhang","given":"Xingtan"},{"family":"Liao","given":"Zhenyang"},{"family":"Wai","given":"Ching Man"},{"family":"Xu","given":"Xiuming"},{"family":"Chen","given":"Shuai"},{"family":"Zhang","given":"Shengchen"}],"citation-key":"yueSunUpSunsetGenomes2022","container-title":"Nature Genetics","issue":"5","issued":{"date-parts":[["2022"]]},"page":"715–724","publisher":"Nature Publishing Group US New York","source":"Google Scholar","title":"SunUp and Sunset genomes revealed impact of particle bombardment mediated transformation and domestication history in papaya","type":"article-journal","URL":"https://www.nature.com/articles/s41588-022-01068-1","volume":"54"}
]
