[
  {"id":"danecekTwelveYearsSAMtools2021","abstract":"Abstract\n            \n              Background\n              SAMtools and BCFtools are widely used programs for processing and analysing high-throughput sequencing data. They include tools for file format conversion and manipulation, sorting, querying, statistics, variant calling, and effect analysis amongst other methods.\n            \n            \n              Findings\n              The first version appeared online 12 years ago and has been maintained and further developed ever since, with many new features and improvements added over the years. The SAMtools and BCFtools packages represent a unique collection of tools that have been used in numerous other software projects and countless genomic pipelines.\n            \n            \n              Conclusion\n              Both SAMtools and BCFtools are freely available on GitHub under the permissive MIT licence, free for both non-commercial and commercial use. Both packages have been installed &gt;1 million times via Bioconda. The source code and documentation are available from https://www.htslib.org.","author":[{"family":"Danecek","given":"Petr"},{"family":"Bonfield","given":"James K"},{"family":"Liddle","given":"Jennifer"},{"family":"Marshall","given":"John"},{"family":"Ohan","given":"Valeriu"},{"family":"Pollard","given":"Martin O"},{"family":"Whitwham","given":"Andrew"},{"family":"Keane","given":"Thomas"},{"family":"McCarthy","given":"Shane A"},{"family":"Davies","given":"Robert M"},{"family":"Li","given":"Heng"}],"citation-key":"danecekTwelveYearsSAMtools2021","container-title":"GigaScience","container-title-short":"GigaScience","DOI":"10.1093/gigascience/giab008","ISSN":"2047-217X","issue":"2","issued":{"date-parts":[["2021",1,29]]},"language":"en-US","page":"giab008","PMCID":"PMC7931819","PMID":"33590861","source":"PubMed","title":"Twelve years of SAMtools and BCFtools","type":"article-journal","URL":"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giab008/6137722","volume":"10"},
  {"id":"danecekVariantCallFormat2011","abstract":"Abstract\n            Summary: The variant call format (VCF) is a generic format for storing DNA polymorphism data such as SNPs, insertions, deletions and structural variants, together with rich annotations. VCF is usually stored in a compressed manner and can be indexed for fast data retrieval of variants from a range of positions on the reference genome. The format was developed for the 1000 Genomes Project, and has also been adopted by other projects such as UK10K, dbSNP and the NHLBI Exome Project. VCFtools is a software suite that implements various utilities for processing VCF files, including validation, merging, comparing and also provides a general Perl API.\n            Availability:  http://vcftools.sourceforge.net\n            Contact:  rd@sanger.ac.uk","author":[{"family":"Danecek","given":"Petr"},{"family":"Auton","given":"Adam"},{"family":"Abecasis","given":"Goncalo"},{"family":"Albers","given":"Cornelis A."},{"family":"Banks","given":"Eric"},{"family":"DePristo","given":"Mark A."},{"family":"Handsaker","given":"Robert E."},{"family":"Lunter","given":"Gerton"},{"family":"Marth","given":"Gabor T."},{"family":"Sherry","given":"Stephen T."},{"family":"McVean","given":"Gilean"},{"family":"Durbin","given":"Richard"},{"literal":"1000 Genomes Project Analysis Group"}],"citation-key":"danecekVariantCallFormat2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr330","ISSN":"1367-4811, 1367-4803","issue":"15","issued":{"date-parts":[["2011",8,1]]},"language":"en-US","page":"2156-2158","source":"DOI.org (Crossref)","title":"The variant call format and VCFtools","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/27/15/2156/402296","volume":"27"},
  {"id":"ewelsMultiQCSummarizeAnalysis2016","abstract":"Motivation: Fast and accurate quality control is essential for studies involving next-generation sequencing data. Whilst numerous tools exist to quantify QC metrics, there is no common approach to flexibly integrate these across tools and large sample sets. Assessing analysis results across an entire project can be time consuming and error prone; batch effects and outlier samples can easily be missed in the early stages of analysis., Results: We present MultiQC, a tool to create a single report visualising output from multiple tools across many samples, enabling global trends and biases to be quickly identified. MultiQC can plot data from many common bioinformatics tools and is built to allow easy extension and customization., Availability and implementation: MultiQC is available with an GNU GPLv3 license on GitHub, the Python Package Index and Bioconda. Documentation and example reports are available at \nhttp://multiqc.info, Contact:\nphil.ewels@scilifelab.se","accessed":{"date-parts":[["2017",7,19]]},"author":[{"family":"Ewels","given":"Philip"},{"family":"Magnusson","given":"Måns"},{"family":"Lundin","given":"Sverker"},{"family":"Käller","given":"Max"}],"citation-key":"ewelsMultiQCSummarizeAnalysis2016","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btw354","ISSN":"1367-4803","issue":"19","issued":{"date-parts":[["2016",10,1]]},"note":"00021","page":"3047-3048","PMCID":"PMC5039924","PMID":"27312411","source":"PubMed Central","title":"MultiQC: summarize analysis results for multiple tools and samples in a single report","title-short":"MultiQC","type":"article-journal","URL":"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC5039924/","volume":"32"},
  {"id":"garrisonHaplotypebasedVariantDetection2012","abstract":"The direct detection of haplotypes from short-read DNA sequencing data requires changes to existing small-variant detection methods. Here, we develop a Bayesian statistical framework which is capable of modeling multiallelic loci in sets of individuals with non-uniform copy number. We then describe our implementation of this framework in a haplotype-based variant detector, FreeBayes.","accessed":{"date-parts":[["2023",6,27]]},"author":[{"family":"Garrison","given":"Erik"},{"family":"Marth","given":"Gabor"}],"citation-key":"garrisonHaplotypebasedVariantDetection2012","DOI":"10.48550/ARXIV.1207.3907","issued":{"date-parts":[["2012"]]},"language":"en-US","license":"Creative Commons Attribution 3.0 Unported","publisher":"arXiv","source":"DOI.org (Datacite)","title":"Haplotype-based variant detection from short-read sequencing","type":"article-journal","URL":"https://arxiv.org/abs/1207.3907","version":"2"},
  {"id":"katzComparativeAnalysisLyveSET2017","abstract":"Modern epidemiology of foodborne bacterial pathogens in industrialized countries relies increasingly on whole genome sequencing techniques. As opposed to profiling techniques such as pulsed field gel electrophoresis, whole genome sequencing requires a variety of computational methods. Since 2013, United States agencies responsible for food safety including the CDC, FDA, and USDA, have been performing whole-genome sequencing (WGS) on all Listeria monocytogenes found in clinical, food, and environmental samples. Each year, more genomes of other foodborne pathogens such as Escherichia coli, Campylobacter jejuni, and Salmonella enterica are being sequenced. Comparing thousands of genomes across an entire species requires a fast method with coarse resolution; however, capturing the fine details of highly related isolates requires a computationally heavy and sophisticated algorithm. Most L. monocytogenes investigations employing WGS depend on being able to identify an outbreak clade whose inter-genomic distances are less than an empirically determined threshold. When the difference between a few single nucleotide polymorphisms (SNPs) can help distinguish between genomes that are likely outbreak-associated and those that are less likely to be associated, we require a fine-resolution method. To achieve this level of resolution, we have developed Lyve-SET, a high-quality SNP pipeline. We evaluated Lyve-SET by retrospectively investigating 12 outbreak data sets along with four other SNP pipelines that have been used in outbreak investigation or similar scenarios. To compare these pipelines, several distance and phylogeny-based comparison methods were applied, which collectively showed that multiple pipelines were able to identify most outbreak clusters and strains. Currently in the US PulseNet system, whole genome multi-locus sequence typing (wgMLST) is the preferred primary method for foodborne WGS cluster detection and outbreak investigation due to its ability to name standardized genomic profiles, its central database, and its ability to be run in a graphical user interface. However, creating a functional wgMLST scheme requires extended up-front development and subject-matter expertise. When a scheme does not exist or when the highest resolution is needed, SNP analysis is used. Using three Listeria outbreak data sets, we demonstrated the concordance between Lyve-SET SNP typing and wgMLST.Availability: Lyve-SET can be found at https://github.com/lskatz/Lyve-SET.","accessed":{"date-parts":[["2025",10,28]]},"author":[{"family":"Katz","given":"Lee S."},{"family":"Griswold","given":"Taylor"},{"family":"Williams-Newkirk","given":"Amanda J."},{"family":"Wagner","given":"Darlene"},{"family":"Petkau","given":"Aaron"},{"family":"Sieffert","given":"Cameron"},{"family":"Van Domselaar","given":"Gary"},{"family":"Deng","given":"Xiangyu"},{"family":"Carleton","given":"Heather A."}],"citation-key":"katzComparativeAnalysisLyveSET2017","container-title":"Frontiers in Microbiology","container-title-short":"Front. Microbiol.","DOI":"10.3389/fmicb.2017.00375","ISSN":"1664-302X","issued":{"date-parts":[["2017",3,13]]},"language":"en","publisher":"Frontiers","source":"Frontiers","title":"A comparative analysis of the lyve-SET phylogenomics pipeline for genomic epidemiology of foodborne pathogens","type":"article-journal","URL":"https://www.frontiersin.org/journals/microbiology/articles/10.3389/fmicb.2017.00375/full","volume":"8"},
  {"id":"kozlovRAxMLNGFastScalable2019","abstract":"Phylogenies are important for fundamental biological research, but also have numerous applications in biotechnology, agriculture and medicine. Finding the optimal tree under the popular maximum likelihood (ML) criterion is known to be NP-hard. Thus, highly optimized and scalable codes are needed to analyze constantly growing empirical datasets.We present RAxML-NG, a from-scratch re-implementation of the established greedy tree search algorithm of RAxML/ExaML. RAxML-NG offers improved accuracy, flexibility, speed, scalability, and usability compared with RAxML/ExaML. On taxon-rich datasets, RAxML-NG typically finds higher-scoring trees than IQTree, an increasingly popular recent tool for ML-based phylogenetic inference (although IQ-Tree shows better stability). Finally, RAxML-NG introduces several new features, such as the detection of terraces in tree space and the recently introduced transfer bootstrap support metric.The code is available under GNU GPL at https://github.com/amkozlov/raxml-ng. RAxML-NG web service (maintained by Vital-IT) is available at https://raxml-ng.vital-it.ch/.Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2025",10,29]]},"author":[{"family":"Kozlov","given":"Alexey M"},{"family":"Darriba","given":"Diego"},{"family":"Flouri","given":"Tomáš"},{"family":"Morel","given":"Benoit"},{"family":"Stamatakis","given":"Alexandros"}],"citation-key":"kozlovRAxMLNGFastScalable2019","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btz305","ISSN":"1367-4803","issue":"21","issued":{"date-parts":[["2019",11,1]]},"language":"en","page":"4453-4455","source":"Silverchair","title":"RAxML-NG: a fast, scalable and user-friendly tool for maximum likelihood phylogenetic inference","title-short":"RAxML-NG","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btz305","volume":"35"},
  {"id":"leeSNPhyloPipelineConstruct2014","abstract":"Background\nPhylogenetic trees are widely used for genetic and evolutionary studies in various organisms. Advanced sequencing technology has dramatically enriched data available for constructing phylogenetic trees based on single nucleotide polymorphisms (SNPs). However, massive SNP data makes it difficult to perform reliable analysis, and there has been no ready-to-use pipeline to generate phylogenetic trees from these data.\n\nResults\nWe developed a new pipeline, SNPhylo, to construct phylogenetic trees based on large SNP datasets. The pipeline may enable users to construct a phylogenetic tree from three representative SNP data file formats. In addition, in order to increase reliability of a tree, the pipeline has steps such as removing low quality data and considering linkage disequilibrium. A maximum likelihood method for the inference of phylogeny is also adopted in generation of a tree in our pipeline.\n\nConclusions\nUsing SNPhylo, users can easily produce a reliable phylogenetic tree from a large SNP data file. Thus, this pipeline can help a researcher focus more on interpretation of the results of analysis of voluminous data sets, rather than manipulations necessary to accomplish the analysis.","accessed":{"date-parts":[["2025",10,28]]},"author":[{"family":"Lee","given":"Tae-Ho"},{"family":"Guo","given":"Hui"},{"family":"Wang","given":"Xiyin"},{"family":"Kim","given":"Changsoo"},{"family":"Paterson","given":"Andrew H"}],"citation-key":"leeSNPhyloPipelineConstruct2014","container-title":"BMC Genomics","container-title-short":"BMC Genomics","DOI":"10.1186/1471-2164-15-162","ISSN":"1471-2164","issued":{"date-parts":[["2014",2,26]]},"language":"en","page":"162","PMCID":"PMC3945939","PMID":"24571581","source":"PubMed Central","title":"SNPhylo: a pipeline to construct a phylogenetic tree from huge SNP data","title-short":"SNPhylo","type":"article-journal","URL":"https://pmc.ncbi.nlm.nih.gov/articles/PMC3945939/","volume":"15"},
  {"id":"liSequenceAlignmentMap2009a","abstract":"SUMMARY: The Sequence Alignment/Map (SAM) format is a generic alignment format for storing read alignments against reference sequences, supporting short and long reads (up to 128 Mbp) produced by different sequencing platforms. It is flexible in style, compact in size, efficient in random access and is the format in which alignments from the 1000 Genomes Project are released. SAMtools implements various utilities for post-processing alignments in the SAM format, such as indexing, variant caller and alignment viewer, and thus provides universal tools for processing read alignments.\nAVAILABILITY: http://samtools.sourceforge.net.","author":[{"family":"Li","given":"Heng"},{"family":"Handsaker","given":"Bob"},{"family":"Wysoker","given":"Alec"},{"family":"Fennell","given":"Tim"},{"family":"Ruan","given":"Jue"},{"family":"Homer","given":"Nils"},{"family":"Marth","given":"Gabor"},{"family":"Abecasis","given":"Goncalo"},{"family":"Durbin","given":"Richard"},{"literal":"1000 Genome Project Data Processing Subgroup"}],"citation-key":"liSequenceAlignmentMap2009a","container-title":"Bioinformatics (Oxford, England)","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btp352","ISSN":"1367-4811","issue":"16","issued":{"date-parts":[["2009",8,15]]},"language":"eng","page":"2078-2079","PMCID":"PMC2723002","PMID":"19505943","source":"PubMed","title":"The Sequence Alignment/Map format and SAMtools","type":"article-journal","volume":"25"},
  {"id":"liStatisticalFrameworkSNP2011","abstract":"Abstract\n            Motivation: Most existing methods for DNA sequence analysis rely on accurate sequences or genotypes. However, in applications of the next-generation sequencing (NGS), accurate genotypes may not be easily obtained (e.g. multi-sample low-coverage sequencing or somatic mutation discovery). These applications press for the development of new methods for analyzing sequence data with uncertainty.\n            Results: We present a statistical framework for calling SNPs, discovering somatic mutations, inferring population genetical parameters and performing association tests directly based on sequencing data without explicit genotyping or linkage-based imputation. On real data, we demonstrate that our method achieves comparable accuracy to alternative methods for estimating site allele count, for inferring allele frequency spectrum and for association mapping. We also highlight the necessity of using symmetric datasets for finding somatic mutations and confirm that for discovering rare events, mismapping is frequently the leading source of errors.\n            Availability:  http://samtools.sourceforge.net\n            Contact:  hengli@broadinstitute.org","accessed":{"date-parts":[["2023",6,27]]},"author":[{"family":"Li","given":"Heng"}],"citation-key":"liStatisticalFrameworkSNP2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr509","ISSN":"1367-4811, 1367-4803","issue":"21","issued":{"date-parts":[["2011",11,1]]},"language":"en-US","page":"2987-2993","PMCID":"PMC3198575","PMID":"21903627","source":"PubMed Central","title":"A statistical framework for SNP calling, mutation discovery, association mapping and population genetical parameter estimation from sequencing data","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3198575/","volume":"27"},
  {"id":"okonechnikovQualimapAdvancedMultisample2016","abstract":"Motivation: Detection of random errors and systematic biases is a crucial step of a robust pipeline for processing high-throughput sequencing (HTS) data. Bioinformatics software tools capable of performing this task are available, either for general analysis of HTS data or targeted to a specific sequencing technology. However, most of the existing QC instruments only allow processing of one sample at a time.Results: Qualimap 2 represents a next step in the QC analysis of HTS data. Along with comprehensive single-sample analysis of alignment data, it includes new modes that allow simultaneous processing and comparison of multiple samples. As with the first version, the new features are available via both graphical and command line interface. Additionally, it includes a large number of improvements proposed by the user community.Availability and implementation: The implementation of the software along with documentation is freely available at http://www.qualimap.org.Contact:meyer@mpiib-berlin.mpg.deSupplementary information:Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2017",7,28]]},"author":[{"family":"Okonechnikov","given":"Konstantin"},{"family":"Conesa","given":"Ana"},{"family":"García-Alcalde","given":"Fernando"}],"citation-key":"okonechnikovQualimapAdvancedMultisample2016","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btv566","ISSN":"1367-4803","issue":"2","issued":{"date-parts":[["2016",1,15]]},"note":"00050","page":"292-294","source":"academic.oup.com","title":"Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data","title-short":"Qualimap 2","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/32/2/292/1744356/Qualimap-2-advanced-multi-sample-quality-control","volume":"32"},
  {"id":"pedersenMosdepthQuickCoverage2018","abstract":"Abstract\n            \n              Summary\n              Mosdepth is a new command-line tool for rapidly calculating genome-wide sequencing coverage. It measures depth from BAM or CRAM files at either each nucleotide position in a genome or for sets of genomic regions. Genomic regions may be specified as either a BED file to evaluate coverage across capture regions, or as a fixed-size window as required for copy-number calling. Mosdepth uses a simple algorithm that is computationally efficient and enables it to quickly produce coverage summaries. We demonstrate that mosdepth is faster than existing tools and provides flexibility in the types of coverage profiles produced.\n            \n            \n              Availability and implementation\n              mosdepth is available from https://github.com/brentp/mosdepth under the MIT license.\n            \n            \n              Supplementary information\n              Supplementary data are available at Bioinformatics online.","author":[{"family":"Pedersen","given":"Brent S"},{"family":"Quinlan","given":"Aaron R"}],"citation-key":"pedersenMosdepthQuickCoverage2018","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btx699","editor":[{"family":"Hancock","given":"John"}],"ISSN":"1367-4803, 1367-4811","issue":"5","issued":{"date-parts":[["2018",3,1]]},"language":"en-US","page":"867-868","PMCID":"PMC6030888","PMID":"29096012","source":"PubMed","title":"Mosdepth: quick coverage calculation for genomes and exomes","title-short":"Mosdepth","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/34/5/867/4583630","volume":"34"},
  {"id":"petkauSNVPhylSingleNucleotide2017a","abstract":"The recent widespread application of whole-genome sequencing (WGS) for microbial disease investigations has spurred the development of new bioinformatics tools, including a notable proliferation of phylogenomics pipelines designed for infectious disease surveillance and outbreak investigation. Transitioning the use of WGS data out of the research laboratory and into the front lines of surveillance and outbreak response requires user-friendly, reproducible and scalable pipelines that have been well validated. Single Nucleotide Variant Phylogenomics (SNVPhyl) is a bioinformatics pipeline for identifying high-quality single-nucleotide variants (SNVs) and constructing a whole-genome phylogeny from a collection of WGS reads and a reference genome. Individual pipeline components are integrated into the Galaxy bioinformatics framework, enabling data analysis in a user-friendly, reproducible and scalable environment. We show that SNVPhyl can detect SNVs with high sensitivity and specificity, and identify and remove regions of high SNV density (indicative of recombination). SNVPhyl is able to correctly distinguish outbreak from non-outbreak isolates across a range of variant-calling settings, sequencing-coverage thresholds or in the presence of contamination. SNVPhyl is available as a Galaxy workflow, Docker and virtual machine images, and a Unix-based command-line application. SNVPhyl is released under the Apache 2.0 license and available at http://snvphyl.readthedocs.io/ or at https://github.com/phac-nml/snvphyl-galaxy.","accessed":{"date-parts":[["2025",10,28]]},"author":[{"family":"Petkau","given":"Aaron"},{"family":"Mabon","given":"Philip"},{"family":"Sieffert","given":"Cameron"},{"family":"Knox","given":"Natalie C."},{"family":"Cabral","given":"Jennifer"},{"family":"Iskander","given":"Mariam"},{"family":"Iskander","given":"Mark"},{"family":"Weedmark","given":"Kelly"},{"family":"Zaheer","given":"Rahat"},{"family":"Katz","given":"Lee S."},{"family":"Nadon","given":"Celine"},{"family":"Reimer","given":"Aleisha"},{"family":"Taboada","given":"Eduardo"},{"family":"Beiko","given":"Robert G."},{"family":"Hsiao","given":"William"},{"family":"Brinkman","given":"Fiona"},{"family":"Graham","given":"Morag"},{"family":"Van Domselaar","given":"Gary"}],"citation-key":"petkauSNVPhylSingleNucleotide2017a","container-title":"Microbial Genomics","container-title-short":"Microb. Genomics","DOI":"10.1099/mgen.0.000116","ISSN":"2057-5858","issue":"6","issued":{"date-parts":[["2017"]]},"language":"en","page":"e000116","publisher":"Microbiology Society,","source":"Microbiology Society Journals","title":"SNVPhyl: a single nucleotide variant phylogenomics pipeline for microbial genomic epidemiology","title-short":"SNVPhyl","type":"article-journal","URL":"https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.000116","volume":"3"},
  {"id":"pineiroVeryFastTree2020","abstract":"Abstract\n            \n              Motivation\n              FastTree-2 is one of the most successful tools for inferring large phylogenies. With speed at the core of its design, there are still important issues in the FastTree-2 implementation that harm its performance and scalability. To deal with these limitations, we introduce VeryFastTree, a highly tuned implementation of the FastTree-2 tool that takes advantage of parallelization and vectorization strategies to boost performance.\n            \n            \n              Results\n              VeryFastTree is able to construct a tree on a standard server using double-precision arithmetic from an ultra-large 330k alignment in only 4.5 h, which is 7.8× and 3.5× faster than the sequential and best parallel FastTree-2 times, respectively.\n            \n            \n              Availability and implementation\n              VeryFastTree is available at the GitHub repository: https://github.com/citiususc/veryfasttree.\n            \n            \n              Supplementary information\n              Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2023",6,24]]},"author":[{"family":"Piñeiro","given":"César"},{"family":"Abuín","given":"José M"},{"family":"Pichel","given":"Juan C"}],"citation-key":"pineiroVeryFastTree2020","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btaa582","editor":[{"family":"Ponty","given":"Yann"}],"ISSN":"1367-4803, 1367-4811","issue":"17","issued":{"date-parts":[["2020",11,1]]},"language":"en-US","page":"4658-4659","source":"Silverchair","title":"Very Fast Tree: speeding up the estimation of phylogenies for large alignments through parallelization and vectorization strategies","title-short":"Very Fast Tree","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btaa582","volume":"36"},
  {"id":"rudenUsingDrosophilaMelanogaster2012","abstract":"This paper describes a new program SnpSift for filtering differential DNA sequence variants between two or more experimental genomes after genotoxic chemical exposure. Here, we illustrate how SnpSift can be used to identify candidate phenotype-relevant variants including single nucleotide polymorphisms, multiple nucleotide polymorphisms, insertions, and deletions (InDels) in mutant strains isolated from genome-wide chemical mutagenesis of Drosophila melanogaster. First, the genomes of two independently isolated mutant fly strains that are allelic for a novel recessive male-sterile locus generated by genotoxic chemical exposure were sequenced using the Illumina next-generation DNA sequencer to obtain 20- to 29-fold coverage of the euchromatic sequences. The sequencing reads were processed and variants were called using standard bioinformatic tools. Next, SnpEff was used to annotate all sequence variants and their potential mutational effects on associated genes. Then, SnpSift was used to filter and select differential variants that potentially disrupt a common gene in the two allelic mutant strains. The potential causative DNA lesions were partially validated by capillary sequencing of polymerase chain reaction-amplified DNA in the genetic interval as defined by meiotic mapping and deletions that remove defined regions of the chromosome. Of the five candidate genes located in the genetic interval, the Pka-like gene CG12069 was found to carry a separate pre-mature stop codon mutation in each of the two allelic mutants whereas the other four candidate genes within the interval have wild-type sequences. The Pka-like gene is therefore a strong candidate gene for the male-sterile locus. These results demonstrate that combining SnpEff and SnpSift can expedite the identification of candidate phenotype-causative mutations in chemically mutagenized Drosophila strains. This technique can also be used to characterize the variety of mutations generated by genotoxic chemicals.","accessed":{"date-parts":[["2016",11,4]]},"author":[{"family":"Ruden","given":"Douglas Mark"},{"family":"Cingolani","given":"Pablo"},{"family":"Patel","given":"Viral M."},{"family":"Coon","given":"Melissa"},{"family":"Nguyen","given":"Tung"},{"family":"Land","given":"Susan J."},{"family":"Lu","given":"Xiangyi"}],"citation-key":"rudenUsingDrosophilaMelanogaster2012","container-title":"Toxicogenomics","container-title-short":"Drosophila melanogaster","DOI":"10.3389/fgene.2012.00035","issued":{"date-parts":[["2012"]]},"page":"35","source":"Frontiers","title":"Using <i>Drosophila melanogaster</i> as a model for genotoxic chemical mutational studies with a new program, SnpSift","type":"article-journal","URL":"http://journal.frontiersin.org/article/10.3389/fgene.2012.00035/full","volume":"3"},
  {"id":"salojarviGenomePopulationGenomics2024","abstract":"Coffea arabica, an allotetraploid hybrid of Coffea eugenioides and Coffea canephora, is the source of approximately 60% of coffee products worldwide, and its cultivated accessions have undergone several population bottlenecks. We present chromosome-level assemblies of a di-haploid C. arabica accession and modern representatives of its diploid progenitors, C. eugenioides and C. canephora. The three species exhibit largely conserved genome structures between diploid parents and descendant subgenomes, with no obvious global subgenome dominance. We find evidence for a founding polyploidy event 350,000–610,000 years ago, followed by several pre-domestication bottlenecks, resulting in narrow genetic variation. A split between wild accessions and cultivar progenitors occurred ~30.5 thousand years ago, followed by a period of migration between the two populations. Analysis of modern varieties, including lines historically introgressed with C. canephora, highlights their breeding histories and loci that may contribute to pathogen resistance, laying the groundwork for future genomics-based breeding of C. arabica.","accessed":{"date-parts":[["2025",8,22]]},"author":[{"family":"Salojärvi","given":"Jarkko"},{"family":"Rambani","given":"Aditi"},{"family":"Yu","given":"Zhe"},{"family":"Guyot","given":"Romain"},{"family":"Strickler","given":"Susan"},{"family":"Lepelley","given":"Maud"},{"family":"Wang","given":"Cui"},{"family":"Rajaraman","given":"Sitaram"},{"family":"Rastas","given":"Pasi"},{"family":"Zheng","given":"Chunfang"},{"family":"Muñoz","given":"Daniella Santos"},{"family":"Meidanis","given":"João"},{"family":"Paschoal","given":"Alexandre Rossi"},{"family":"Bawin","given":"Yves"},{"family":"Krabbenhoft","given":"Trevor J."},{"family":"Wang","given":"Zhen Qin"},{"family":"Fleck","given":"Steven J."},{"family":"Aussel","given":"Rudy"},{"family":"Bellanger","given":"Laurence"},{"family":"Charpagne","given":"Aline"},{"family":"Fournier","given":"Coralie"},{"family":"Kassam","given":"Mohamed"},{"family":"Lefebvre","given":"Gregory"},{"family":"Métairon","given":"Sylviane"},{"family":"Moine","given":"Déborah"},{"family":"Rigoreau","given":"Michel"},{"family":"Stolte","given":"Jens"},{"family":"Hamon","given":"Perla"},{"family":"Couturon","given":"Emmanuel"},{"family":"Tranchant-Dubreuil","given":"Christine"},{"family":"Mukherjee","given":"Minakshi"},{"family":"Lan","given":"Tianying"},{"family":"Engelhardt","given":"Jan"},{"family":"Stadler","given":"Peter"},{"family":"Correia De Lemos","given":"Samara Mireza"},{"family":"Suzuki","given":"Suzana Ivamoto"},{"family":"Sumirat","given":"Ucu"},{"family":"Wai","given":"Ching Man"},{"family":"Dauchot","given":"Nicolas"},{"family":"Orozco-Arias","given":"Simon"},{"family":"Garavito","given":"Andrea"},{"family":"Kiwuka","given":"Catherine"},{"family":"Musoli","given":"Pascal"},{"family":"Nalukenge","given":"Anne"},{"family":"Guichoux","given":"Erwan"},{"family":"Reinout","given":"Havinga"},{"family":"Smit","given":"Martin"},{"family":"Carretero-Paulet","given":"Lorenzo"},{"family":"Filho","given":"Oliveiro Guerreiro"},{"family":"Braghini","given":"Masako Toma"},{"family":"Padilha","given":"Lilian"},{"family":"Sera","given":"Gustavo Hiroshi"},{"family":"Ruttink","given":"Tom"},{"family":"Henry","given":"Robert"},{"family":"Marraccini","given":"Pierre"},{"family":"Van de Peer","given":"Yves"},{"family":"Andrade","given":"Alan"},{"family":"Domingues","given":"Douglas"},{"family":"Giuliano","given":"Giovanni"},{"family":"Mueller","given":"Lukas"},{"family":"Pereira","given":"Luiz Filipe"},{"family":"Plaisance","given":"Stephane"},{"family":"Poncet","given":"Valerie"},{"family":"Rombauts","given":"Stephane"},{"family":"Sankoff","given":"David"},{"family":"Albert","given":"Victor A."},{"family":"Crouzillat","given":"Dominique"},{"family":"Kochko","given":"Alexandre","non-dropping-particle":"de"},{"family":"Descombes","given":"Patrick"}],"citation-key":"salojarviGenomePopulationGenomics2024","container-title":"Nature Genetics","container-title-short":"Nat. Genet.","DOI":"10.1038/s41588-024-01695-w","ISSN":"1546-1718","issue":"4","issued":{"date-parts":[["2024",4]]},"language":"en","license":"2024 The Author(s)","page":"721-731","publisher":"Nature Publishing Group","source":"www.nature.com","title":"The genome and population genomics of allopolyploid coffea arabica reveal the diversification history of modern coffee cultivars","type":"article-journal","URL":"https://www.nature.com/articles/s41588-024-01695-w","volume":"56"},
  {"id":"tischlerBiobambamToolsRead2014","abstract":"Sequence alignment data is often ordered by coordinate (id of the reference sequence plus position on the sequence where the fragment was mapped) when stored in BAM files, as this simplifies the extraction of variants between the mapped data and the reference or of variants within the mapped data. In this order paired reads are usually separated in the file, which complicates some other applications like duplicate marking or conversion to the FastQ format which require to access the full information of the pairs.","accessed":{"date-parts":[["2020",11,25]]},"author":[{"family":"Tischler","given":"German"},{"family":"Leonard","given":"Steven"}],"citation-key":"tischlerBiobambamToolsRead2014","container-title":"Source Code for Biology and Medicine","container-title-short":"Source Code for Biology and Medicine","DOI":"10.1186/1751-0473-9-13","ISSN":"1751-0473","issue":"1","issued":{"date-parts":[["2014",6,20]]},"page":"13","source":"BioMed Central","title":"biobambam: tools for read pair collation based algorithms on BAM files","title-short":"biobambam","type":"article-journal","URL":"https://doi.org/10.1186/1751-0473-9-13","volume":"9"},
  {"id":"vasimuddinEfficientArchitectureAwareAcceleration2019","abstract":"Innovations in Next-Generation Sequencing are enabling generation of DNA sequence data at ever faster rates and at very low cost. For example, the Illumina NovaSeq 6000 sequencer can generate 6 Terabases of data in less than two days, sequencing nearly 20 Billion short DNA fragments called reads at the low cost of $1000 per human genome. Large sequencing centers typically employ hundreds of such systems. Such highthroughput and low-cost generation of data underscores the need for commensurate acceleration in downstream computational analysis of the sequencing data. A fundamental step in downstream analysis is mapping of the reads to a long reference DNA sequence, such as a reference human genome. Sequence mapping is a compute-intensive step that accounts for more than 30% of the overall time of the GATK (Genome Analysis ToolKit) best practices workflow. BWA-MEM is one of the most widely used tools for sequence mapping and has tens of thousands of users. In this work, we focus on accelerating BWA-MEM through an efficient architecture aware implementation, while maintaining identical output. The volume of data requires distributed computing and is usually processed on clusters or cloud deployments with multicore processors usually being the platform of choice. Since the application can be easily parallelized across multiple sockets (even across distributed memory systems) by simply distributing the reads equally, we focus on performance improvements on a single socket multicore processor. BWA-MEM run time is dominated by three kernels, collectively responsible for more than 85% of the overall compute time. We improved the performance of the three kernels by 1) using techniques to improve cache reuse, 2) simplifying the algorithms, 3) replacing many small memory allocations with a few large contiguous ones to improve hardware prefetching of data, 4) software prefetching of data, and 5) utilization of SIMD wherever applicable and massive reorganization of the source code to enable these improvements. As a result, we achieved nearly 2x, 183x, and 8x speedups on the three kernels, respectively, resulting in up to 3.5x and 2.4x speedups on end-to-end compute time over the original BWA-MEM on single thread and single socket of Intel Xeon Skylake processor. To the best of our knowledge, this is the highest reported speedup over BWA-MEM (running on a single CPU) while using a single CPU or a single CPU-single GPGPU/FPGA combination.","author":[{"family":"Vasimuddin","given":"Md."},{"family":"Misra","given":"Sanchit"},{"family":"Li","given":"Heng"},{"family":"Aluru","given":"Srinivas"}],"citation-key":"vasimuddinEfficientArchitectureAwareAcceleration2019","container-title":"2019 IEEE International Parallel and Distributed Processing Symposium (IPDPS)","DOI":"10.1109/IPDPS.2019.00041","event-title":"2019 IEEE International Parallel and Distributed Processing Symposium (IPDPS)","ISSN":"1530-2075","issued":{"date-parts":[["2019",5]]},"page":"314-324","source":"IEEE Xplore","title":"Efficient Architecture-Aware Acceleration of BWA-MEM for Multicore Systems","type":"paper-conference"},
  {"id":"wongIQTREE3Phylogenomic2025","abstract":"IQ-TREE (http://www.iqtree.org) is a widely used open-source software tool for efficiently inferring phylogenetic trees under maximum likelihood. Here, we present IQ-TREE version 3, the third major release of the software. IQ-TREE 3 significantly extends version 2 with new features, including mixture models as an alternative to partitioned models, gene and site concordance factors to quantify discordance between genomic regions, and a fully-featured sequence simulator. The IQ-TREE 3 source code is available at https://github.com/iqtree/iqtree3.","accessed":{"date-parts":[["2025",10,29]]},"author":[{"family":"Wong","given":"Thomas K. F."},{"family":"Ly-Trong","given":"Nhan"},{"family":"Ren","given":"Huaiyan"},{"family":"Baños","given":"Hector"},{"family":"Roger","given":"Andrew J."},{"family":"Susko","given":"Edward"},{"family":"Bielow","given":"Chris"},{"family":"Maio","given":"Nicola De"},{"family":"Goldman","given":"Nick"},{"family":"Hahn","given":"Matthew W."},{"family":"Huttley","given":"Gavin"},{"family":"Lanfear","given":"Rob"},{"family":"Minh","given":"Bui Quang"}],"citation-key":"wongIQTREE3Phylogenomic2025","issued":{"date-parts":[["2025",4,7]]},"language":"en","license":"CC BY Attribution 4.0 International","publisher":"EcoEvoRxiv","source":"ecoevorxiv.org","title":"IQ-TREE 3: Phylogenomic Inference Software using Complex Evolutionary Models","title-short":"IQ-TREE 3","type":"article-journal","URL":"https://ecoevorxiv.org/repository/view/8916/"}
]
